Revit 2027 API
CableType.IsCableSizeUsable Method
 Checks whether the Cable Size can be used by this Cable Type or not.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCableSizeUsable(
	ElementId cableSizeId
)
Public Function IsCableSizeUsable (
	cableSizeId As ElementId
) As Boolean
public:
bool IsCableSizeUsable(
	ElementId^ cableSizeId
)
member IsCableSizeUsable :
        cableSizeId : ElementId -> bool
Parameters
cableSizeId ElementId
 The Cable Size id.
Return Value
Boolean
 True if the Cable Size can be used by this Cable Type.
Exceptions
Exception | Condition
ArgumentException |  The id is not a Cable Size id.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace